{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "Is anyone there?",
                "Hello",
                "Good day"
            ],
            "responses": [
                "Hey there! 😀",
                "Hello, lovely to see you! 😀",
                "Hi there, how's your day going? 😀",
                "Hi there, what can I do for you? 😀"
            ]
        },
        {
            "tag": "care",
            "patterns": [
                "Are you well?",
                "How's your health?",
                "Is everything okay with your health?",
                "Hello, how's your health?",
                "is you feeling healthy?",
                "is you ok",
                "are you ok",
                "how are you"
            ],
            "responses": [
                " I'm just a computer program, so I don't have feelings. But I'm here to help you with any questions you have.💻",
                " I don't have a physical body, so I don't get sick. But I'm functioning properly and ready to assist you.💻",
                " I don't have health, as I'm not a living being. But I'm working fine and ready to help you.💻",
                "I don't have health, so there's nothing to check. But I'm functioning as expected and ready to assist you.💻",
                " Hello! I don't have health, but I'm working properly and ready to help you.💻"
            ]
        },

        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye"],
            "responses": [
                "See you later, take care! 👋",
                "Have a fantastic day! 😀",
                "Bye! Come back again soon. 😀"
            ]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
            "responses": [
                "Happy to help! 😀",
                "Any time! 😀",
                "My pleasure! 😀"
            ]
        },
        {
            "tag": "funny",
            "patterns": [
                "Tell me a joke!",
                "Tell me something funny!",
                "Do you know a joke?",
                "I'm very sad. Can you tell me a joke?"
            ],
            "responses": [
                "Sure, here's one: Why did the computer go to the doctor? Because it had a virus! 😄",
                "Here's a classic: Why don't scientists trust atoms? Because they make up everything! 😄"
            ]
        },
        {
            "tag": "services",
            "patterns": ["What services do you offer?"," services you have "],
            "responses": [
                "We offer comprehensive occupational health and safety programs, including risk assessments, safety training, and AI-driven safety management tools."
            ]
        },
        {
            "tag": "safety_program_free",
            "patterns": ["Is your safety program really free?","is this  program is free ","Do you have free program"],
            "responses": [
                "Yes, our foundational safety program is completely free. We also offerpremium services for advanced safety needs.🧺"
            ]
        },
        {
            "tag": "sign_up_free_program",
            "patterns": ["How can I sign up for the free program?","how I can sign up for a free account","IS it free to use "],
            "responses": [
                "Simply click on the 'Services' tab and choose the 'Free Safety Program' option. Fill in your details, and you're all set!ὠ"
            ]
        },
        {
            "tag": "on_site_training",
            "patterns": ["Do you offer on-site training?","Do you have on site training?","Onsite training"],
            "responses": [
                "Yes, we provide on-site training sessions tailored to your specific industry and safety requirements.👌"
            ]
        },
        {
            "tag": "customized_services",
            "patterns": ["Can your services be customized for any industry?","Can your services can be customized?","customized"],
            "responses": [
                "Absolutely! Our solutions are versatile and can be customized to meet the unique safety needs of various industries.👌"
            ]
        },
        {
            "tag": "unique_safety_program",
            "patterns": ["What makes your safety program unique?","how to  make your safety program unique?","unique"],
            "responses": [
                "Our program combines the simplicity of essential safety practices with the sophistication of AI-driven tools, making safety management both effective and hassle-free.\u0001F47B"
            ]
        },
        {
            "tag": "compliance_with_regulations",
            "patterns": ["Are your safety protocols compliant with regulations?","Are your safety protocols compliant with regulations?","Do your safety measures meet industry standards?","How do you ensure regulatory compliance in your safety protocols?" ,"Are you following all safety regulations?"],
            "responses": [
                "Yes, our safety protocols are designed to meet and exceed industry regulations, ensuring your compliance and peace of mind.👌"
            ]
        },
        {
            "tag": "report_incident",
            "patterns": ["How do I report a safety incident?","How i can register report"],
            "responses": [
                "You can report incidents directly through our mobile app or website. Quick reporting ensures prompt action and resolution.📱"
            ]
        },
        {
            "tag": "ai_safety_management",
            "patterns": ["What is AI-driven safety management?"," ai safety managemnt "],
            "responses": [
                "It involves using artificial intelligence to predict potential hazards, streamline safety documentation, and enhance decision-making processes for safety management.👋"
            ]
        },
        {
            "tag": "mobile_app",
            "patterns": ["Do you have a mobile app?","can i have acess to mobile app"],
            "responses": [
                "Yes, our mobile app provides easy access to safety protocols, incident reporting, and safety training materials.📱"
            ]
        },
        {
            "tag": "access_training_materials",
            "patterns": ["How can I access your training materials?","What are the training materials"],
            "responses": [
                "Our training materials are available online. Once you're enrolled in a program, you'll receive access to all relevant resources.🦾"
            ]
        },
        {
            "tag": "custom_quote",
            "patterns": ["Can I get a custom quote for my business?","Could you offer me a special price for my business?"],
            "responses": [
                "Definitely. Contact us with your details, and we'll tailor a quote specifically for your business's safety needs.👋"
            ]
        },
        {
            "tag": "refund_policy",
            "patterns": ["What is your refund policy?","Do you have refund policy"],
            "responses": [
                "While our basic program is free, our premium services come with a satisfaction guarantee. Contact us within 30 days for refund inquiries.📠"
            ]
        },
        {
            "tag": "ai_upgrade",
            "patterns": ["How does the AI upgrade improve safety?","How i can upgrade ai"],
            "responses": [
                "The AI upgrade provides predictive analytics for potential hazards, automates compliance documentation, and offers real-time safety management insights.👋"
            ]
        },
        {
            "tag": "emergency_response_training",
            "patterns": ["Do you offer emergency response training?","Do you have emergency response training?"],
            "responses": [
                "Yes, we provide comprehensive training for emergency preparedness and response to ensure your team is ready for any situation.👋"
            ]
        },
        {
            "tag": "implementation_time",
            "patterns": ["How long does it take to implement your safety program?","how long it take to implement"],
            "responses": [
                "Implementation time can vary, but most businesses are up and running with the basics in just a few weeks.👋"
            ]
        },
        {
            "tag": "monitor_safety_performance",
            "patterns": ["Can I monitor safety performance across multiple locations?","Can i monitor safety perfomance "],
            "responses": [
                "Absolutely! Our platform allows you to monitor and manage safety performance across all your locations in real-time.📠"
            ]
        },
        {
            "tag": "support",
            "patterns": ["What support do you offer if I have questions?","I have a question"],
            "responses": [
                "We offer twentyfour hour  support through our chatbot, email, and phone. Whatever your question, we're here to help anytime.📠"
            ]
        },
        {
            "tag": "update_frequency",
            "patterns": ["How often are safety protocols updated?"],
            "responses": [
                "We regularly review and update our safety protocols to ensure they're in line with the latest regulations and best practices.🌆"
            ]
        },
        {
            "tag": "demo",
            "patterns": ["Can I see a demo of your services?"],
            "responses": [
                "Sure, we'd love to show you how our platform works. Contact us to schedule a live demo at your convenience.😍"
            ]
        },   
          {
            "tag": "customer_support",
            "patterns": ["I need help with something", "Can you assist me with a query?","help","I need help","can you help me"],
            "responses": [
                "Of course! What can I help you with? 😊",
                "I'm here to assist you. Please let me know how I can help. 😊",
                "Sure, I'm ready to assist. What do you need help with? 😊"
            ]
        },        
        {
            "tag": "bad_complaints",
            "patterns": ["I am not happy with you ", "I'm not satisfied with your service", "bad services","I don't like it","I am  very sad "],
            "responses": [
                "I apologize for the inconvenience. Please tell me more about your complaint so I can assist you better. 😔",
                "I'm sorry to hear that. Let's address your concerns. Please tell me what happened. 😔",
                "I'm here to help resolve any issues you're experiencing. Please share the details of your complaint. 😔"
            ]
        },        
        {
            "tag": "compliments",
            "patterns": ["You are doing a great job", "I'm impressed with your service", "Nice one","I am  happy with you"],
            "responses": [
                "Thank you for your kind words! We strive to provide the best service possible. 😊",
                "I'm glad to hear that you're satisfied with our service. Your feedback is much appreciated! 😊",
                "It's wonderful to hear such positive feedback! We're here to assist you anytime. 😊"
            ]
        },        
        {
            "tag": "sing_song",
            "patterns": [
                "Sing me a song",
                "Can you sing?",
                "Sing something for me"
            ],
            "responses": [
                "Sunshine beams through the trees Birds are singing melodies.In the warmth of the golden rays,All my worries fade away.🎶🎼",
                "Oh, happiness, you're here to stay In every moment, come what may.🎶🎼",
                "With laughter, love, and skies so blue,I'm dancing through life with you.🎶🎼",
                "Fields of flowers, colors bright,Fill my heart with pure delight.🎶🎼",
                "With every step, a joyful leap,In this happiness, I'll keep.🎶🎼"
            ]
        },
        {
            "tag": "About me",
            "patterns": [ "What is your name "],
            "responses": [
                "Good day! I'm Greeta, your vigilant voice companion. Let me know how I can lend a hand.😊",
                "Salutations! I'm Greeta, here to make your day a little easier. What can I do for you today?😊",
                "Greetings, I'm Greeta, your guide through the realm of Vigilant site. How may I be of assistance today? 😊"
            ]
            
        }  
    ]
}